app/views/diseases/_form.html.erb

    <%= form.label :date_of_infection_id %>
    <%= form.collection_select :date_of_infection_id, DateOfInfection.all,:id,:date %>
---
SELECT "date_of_infections".* FROM "date_of_infections"