app/views/animals/_form.html.erb

    <%= form.label :owner_id %>
    <%= form.collection_select :owner_id, Owner.all, :id, :first_name%>
---
SELECT "owners".* FROM "owners"