app/views/animals/index.html.erb

        <td><%= animal.name %></td>
        <td><%= animal.owner.first_name %></td>
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]