app/views/animals/show.html.erb

SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Owner:</strong>
  <%= @animal.owner.first_name %>