app/controllers/animals_controller.rb

  def index
    @animals = Animal.all
---
SELECT "animals".* FROM "animals"

  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      if @animal.save
---
INSERT INTO "animals" ("species", "name", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["species", "3"], ["name", "3"], ["owner_id", 1], ["created_at", "2019-10-30 08:25:48.188544"], ["updated_at", "2019-10-30 08:25:48.188544"]]

  def destroy
    @animal.destroy
---
DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]

    def set_animal
      @animal = Animal.find(params[:id])
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]