app/controllers/date_of_infections_controller.rb

  def index
    @date_of_infections = DateOfInfection.all
---
SELECT "date_of_infections".* FROM "date_of_infections"

  def create
    @date_of_infection = DateOfInfection.new(date_of_infection_params)

    respond_to do |format|
      if @date_of_infection.save
---
INSERT INTO "date_of_infections" ("date", "animal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["date", "2019-10-30"], ["animal_id", 1], ["created_at", "2019-10-30 08:26:06.348170"], ["updated_at", "2019-10-30 08:26:06.348170"]]

  def destroy
    @date_of_infection.destroy
---
DELETE FROM "date_of_infections" WHERE "date_of_infections"."id" = ?  [["id", 1]]

    def set_date_of_infection
      @date_of_infection = DateOfInfection.find(params[:id])
---
SELECT "date_of_infections".* FROM "date_of_infections" WHERE "date_of_infections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]