app/controllers/diseases_controller.rb

  def index
    @diseases = Disease.all
---
SELECT "diseases".* FROM "diseases"

  def create
    @disease = Disease.new(disease_params)

    respond_to do |format|
      if @disease.save
---
INSERT INTO "diseases" ("name", "date_of_infection_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Flu"], ["date_of_infection_id", 1], ["created_at", "2019-10-27 18:28:08.228152"], ["updated_at", "2019-10-27 18:28:08.228152"]]

    def set_disease
      @disease = Disease.find(params[:id])
---
SELECT "diseases".* FROM "diseases" WHERE "diseases"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]