app/controllers/owners_controller.rb

  def create
    @owner = Owner.new(owner_params)

    respond_to do |format|
      if @owner.save
---
INSERT INTO "owners" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "g"], ["last_name", "g"], ["created_at", "2019-10-30 08:25:29.394904"], ["updated_at", "2019-10-30 08:25:29.394904"]]

  def destroy
    @owner.destroy
---
DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 1]]

    def set_owner
      @owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]