app/views/date_of_infections/_form.html.erb

    <%= form.label :animal_id %>
    <%= form.collection_select:animal_id, Animal.all, :id, :name %>
---
SELECT "animals".* FROM "animals"